h-2-0deg/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0.00 0.0 0.0)
    (12.1 0.0 0.0)
    (12.1 6.1 0.0)
    (0.00 6.1 0.0)
    (0.00 0.0 3.6)
    (12.1 0.0 3.6)
    (12.1 6.1 3.6)
    (0.00 6.1 3.6)
);

blocks
(
    hex (0 1 2 3 4 5 6 7)
    (121 61 36)
    simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 7 4)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (1 5 6 2)
        );
    }

    ground
    {
        type wall;
        faces
        (
            (0 1 2 3)
        );
    }

    sky
    {
        type patch;
        faces
        (
            (4 7 6 5)
        );
    }

    side_d
    {
        type symmetryPlane;
        faces
        (
            (0 4 5 1)
        );
    }


    side_e
    {
        type symmetryPlane;
        faces
        (
            (3 2 6 7)
        );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
